---
kind: property
id: P:Autodesk.Revit.DB.ReferenceArray.Size
source: html/b7994674-fa53-add1-f648-7734dd8beb39.htm
---
# Autodesk.Revit.DB.ReferenceArray.Size Property

Returns the number of references that are in the array.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```